Exploratory Analysis

Question 1

In [1]:
import numpy as np
import pandas as pd

In [2]:
data1 = pd.read_csv('students.csv')

data1.head()

,gender,parental_education,test_prep_course,math_score,reading_score,writing_score
0,female,bachelor's degree,none,72,72,74
1,female,some college,completed,69,90,88
2,female,master's degree,none,90,95,93
3,male,associate's degree,none,47,57,44
4,male,some college,none,76,78,75

In [3]:
print (data1.gender.value_counts())

#From the data below, we can see that there are more female in the dataset

female    518
male      482
Name: gender, dtype: int64

From the above count, we can see that there are more female compared to male in the dataset.

In [4]:
store = data1.mean(numeric_only=True)
max_index = store.idxmax()
max_score = store.max()

print ("The student's performed best overall in ", max_index, ' with', max_score)

The student's performed best overall in  reading_score  with 69.169

In [5]:
perfect_in_all = sum(data1.sum(axis=1, numeric_only=True)==300)

print (perfect_in_all, 'students scored perfect in all three subjects')

3 students scored perfect in all three subjects

In [6]:
test_prep = data1.iloc[:,2:6]

test_prep

completed_course = test_prep[(test_prep["test_prep_course"]=='completed')].mean()

/var/folders/0q/7yfv43d952dbrjwdnvllyvq40000gn/T/ipykernel_21811/734134633.py:5: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  completed_course = test_prep[(test_prep["test_prep_course"]=='completed')].mean()

In [7]:
none_course = test_prep[(test_prep["test_prep_course"]=='none')].mean()

/var/folders/0q/7yfv43d952dbrjwdnvllyvq40000gn/T/ipykernel_21811/3583932088.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  none_course = test_prep[(test_prep["test_prep_course"]=='none')].mean()

From the averages above, we can see that students who have taken test preparation have better marks with 5 score more in math, 7 score more in reading and 10 score more in writing

Question 2

In [8]:
data2 = pd.read_csv('salary.csv')

data2.head()

   experience_years   age  salary
0               1.1   NaN   39343
1               1.3  24.0   46205
2               1.5  28.7   37731
3               NaN  31.0   43525
4               2.2   NaN   39891

In [9]:
exp_fill = data2.experience_years.fillna(3)

data_ex = pd.concat([data2, exp_fill.rename('filled_exp')], axis=1)

data_ex

age_fill = data2.age.fillna(data2.age.mean())

data_age = pd.concat ([data_ex, age_fill.rename('filled_age')], axis=1)

data_age.head()

   experience_years   age  salary  filled_exp  filled_age
0               1.1   NaN   39343         1.1      31.216
1               1.3  24.0   46205         1.3      24.000
2               1.5  28.7   37731         1.5      28.700
3               NaN  31.0   43525         3.0      31.000
4               2.2   NaN   39891         2.2      31.216

data_ex is creating where we fill NaN value in experience year with 3 years while age_fill has added the mean of all the ages to the NaN value in ages column. I have added these corrected dataset in new column.

In [10]:
age_salary = data_age['filled_age'].corr(data_age['salary'])

print ('The correlation of age and salary is ', age_salary)

The correlation of age and salary is  0.5196367214292624

In [11]:
exp_salary = data_age['filled_exp'].corr(data_age['salary'])

print ('The correlation between experience and salary is ', exp_salary)

The correlation between experience and salary is  0.8346030993050743

From the above two correlation, we can say that while age and salary are positively correlated and where half of the older people are likely to have better salary, experience has a stronger relationship where with increase in experience salary increase can be seen 83% of the times.

In [12]:
salary_bin = [0, 55000, 90000, 125000]
bin_name = ['Low', 'Medium', 'High']

binned = pd.cut (data_age.salary, salary_bin, labels= bin_name)

binned

binned_added = pd.concat([data_age, binned.rename('band')], axis=1)


binned_added

    experience_years   age  salary  filled_exp  filled_age    band
0                1.1   NaN   39343         1.1      31.216     Low
1                1.3  24.0   46205         1.3      24.000     Low
2                1.5  28.7   37731         1.5      28.700     Low
3                NaN  31.0   43525         3.0      31.000     Low
4                2.2   NaN   39891         2.2      31.216     Low
5                2.9  33.0   56642         2.9      33.000  Medium
6                3.0   NaN   60150         3.0      31.216  Medium
7                3.2  34.5   54445         3.2      34.500     Low
8                NaN  28.3   64445         3.0      28.300  Medium
9                3.7  29.6   57189         3.7      29.600  Medium
10               3.9  28.9   63218         3.9      28.900  Medium
11               4.0  34.0   55794         4.0      34.000  Medium
12               4.0  29.5   56957         4.0      29.500  Medium
13               4.1  24.8   57081         4.1      24.800  Medium
14               4.5  35.0   61111         4.5      35.000  Medium
15               4.9  29.2   67938         4.9      29.200  Medium
16               NaN  26.0   66029         3.0      26.000  Medium
17               5.3   NaN   83088         5.3      31.216  Medium
18               5.9  28.0   81363         5.9      28.000  Medium
19               6.0  29.3   93940         6.0      29.300    High
20               6.8  33.2   91738         6.8      33.200    High
21               7.1  30.0   98273         7.1      30.000    High
22               NaN  31.4  101302         3.0      31.400    High
23               8.2  32.0  113812         8.2      32.000    High
24               8.7   NaN  109431         8.7      31.216    High
25               9.0  34.0  105582         9.0      34.000    High
26               NaN  35.0  116969         3.0      35.000    High
27               9.6  36.0  112635         9.6      36.000    High
28              10.3  37.0  122391        10.3      37.000    High
29              10.5  38.0  121872        10.5      38.000    High

In [13]:
print ('The average age of people with "High" salary is', binned_added.filled_age[(binned_added['band']=='High')].mean())

The average age of people with "High" salary is 33.37418181818182

Question 3

In [14]:
data3 = pd.read_csv('movies.csv', index_col=0)

data3.head ()

,title,overview,original_language,vote_count,vote_average
0,Ad Astra,"The near future, a time when both hope and har...",en,2853,5.9
1,Bloodshot,"After he and his wife are murdered, marine Ray...",en,1349,7.2
2,Bad Boys for Life,Marcus and Mike are forced to confront new thr...,en,2530,7.1
3,Ant-Man,Armed with the astonishing ability to shrink i...,en,13611,7.1
4,Percy Jackson: Sea of Monsters,"In their quest to confront the ultimate evil, ...",en,3542,5.9

In [15]:
data_more = data3[data3['vote_count'] >= 100]

data_more

,title,overview,original_language,vote_count,vote_average
0,Ad Astra,"The near future, a time when both hope and har...",en,2853,5.9
1,Bloodshot,"After he and his wife are murdered, marine Ray...",en,1349,7.2
2,Bad Boys for Life,Marcus and Mike are forced to confront new thr...,en,2530,7.1
3,Ant-Man,Armed with the astonishing ability to shrink i...,en,13611,7.1
4,Percy Jackson: Sea of Monsters,"In their quest to confront the ultimate evil, ...",en,3542,5.9
...,...,...,...,...,...
9992,Eagle vs Shark,"The New Zealand made ""Eagle vs Shark"" is the t...",en,154,6.6
9993,High Flying Bird,"During an NBA lockout, a sports agent, Ray Bur...",en,124,5.8
9995,Cargo,The story of CARGO takes place on rusty space-...,de,225,5.9
9997,The World Is Yours,"To escape his life of crime, a Paris drug deal...",fr,234,7.1
9998,The Grand Seduction,A small fishing village must procure a local d...,en,169,6.7

In [16]:
language_count = data_more.original_language.value_counts()
print ('The language which is third highest in the list is ', language_count [2:3])

The language which is third highest in the list is  ja    190
Name: original_language, dtype: int64

From the above code, we see that Japanese is the language with the third highest number of occurences in the list. It was received by getting all the language count and taking the language in the third space using slicer.

In [17]:
finnish_vote = data_more[(data_more['original_language']=='fi')]
print ('There are total of', finnish_vote.vote_count.count(), 'Finnish movies')
print ('This is the Finnish movie with the highest rating')
finnish_vote[(finnish_vote['vote_average']==finnish_vote.vote_average.max())]

There are total of 2 Finnish movies
This is the Finnish movie with the highest rating

,title,overview,original_language,vote_count,vote_average
6553,The Man Without a Past,"The second part of Aki Kaurismäki's ""Finland"" ...",fi,143,7.4

In [18]:
print ('The average of votes for all French movies are', data_more[(data_more['original_language']=='fr')].vote_average.mean())

The average of votes for all French movies are 6.844207317073171

In [19]:
print ('The average of votes for all Spanish movies are', data_more[(data_more['original_language']=='es')].vote_average.mean())

The average of votes for all Spanish movies are 6.823853211009177

From the above two instances, we can see that French movies have a slightly higher average rating as compared to Spanish movies

In [20]:
review_bin = [0, 2.5, 5, 7.5, 10]
review = ['Bad', 'OK', 'Good', 'Excellent']

movie_bin = pd.cut (data_more.vote_average, review_bin, labels= review)

movie_bin

0       Good
1       Good
2       Good
3       Good
4       Good
        ...
9992    Good
9993    Good
9995    Good
9997    Good
9998    Good
Name: vote_average, Length: 8405, dtype: category
Categories (4, object): ['Bad' < 'OK' < 'Good' < 'Excellent']

In [21]:
binned_movie = pd.concat([data_more, movie_bin.rename('review')], axis=1)


binned_movie

review_count = binned_movie.review.value_counts()

print ("Most of the movie has got the rating", review_count.idxmax(), 'with ', review_count.max(), 'movies being in this review bracket')

Most of the movie has got the rating Good with  7008 movies being in this review bracket